/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mjosue <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/07/08 15:57:31 by mjosue            #+#    #+#             */
/*   Updated: 2019/07/08 15:57:45 by mjosue           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */
#include <stdio.h>
void ft_memdel(void **ap);

int main ()
{
    
	// Исходный массив
	//char *src="1234567890";
   
        ft_memdel ((void**)src);

	// Вывод массива src на консоль
	//printf ("chanded src: %s\n",src);
    return(0);
       
}

    
    
    
    

