/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mjosue <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/07/08 15:57:31 by mjosue            #+#    #+#             */
/*   Updated: 2019/07/08 15:57:45 by mjosue           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */
#include <stdio.h>
void * ft_memalloc(size_t size);

int main ()
{
	// Исходный массив
	unsigned char src[15]="1234567890";
	
    ft_memalloc(8);

	// Вывод массива src на консоль
	//printf ("chanded src: %s\n",src);
        return(0);
       
}

    
    
    
    

